In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {
    'Age' : [25,30,35,40,45],
    'Income' : [50000,60000,75000,90000,80000],
    'Education' : ['High School', 'Bachelor', 'Master', 'ph.D.', 'Bachelor'],
    'City' : ['New York','San Francisco', 'Chicago', 'Los Angeles', 'Miami'],
    'Gender' : ['Male', 'Female', 'Male', 'Female', 'Male'],
    'Productivity' : [5,4,3,2,4]
}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

   Age  Income    Education           City  Gender  Productivity
0   25   50000  High School       New York    Male             5
1   30   60000     Bachelor  San Francisco  Female             4
2   35   75000       Master        Chicago    Male             3
3   40   90000        ph.D.    Los Angeles  Female             2
4   45   80000     Bachelor          Miami    Male             4

In [5]:
df_encoded = pd.get_dummies(df, columns = ['Education', 'City', 'Gender'])

In [7]:
df_encoded

,Age,Income,Productivity,Education_Bachelor,Education_High School,Education_Master,Education_ph.D.,City_Chicago,City_Los Angeles,City_Miami,City_New York,City_San Francisco,Gender_Female,Gender_Male
0,25,50000,5,False,True,False,False,False,False,False,True,False,False,True
1,30,60000,4,True,False,False,False,False,False,False,False,True,True,False
2,35,75000,3,False,False,True,False,True,False,False,False,False,False,True
3,40,90000,2,False,False,False,True,False,True,False,False,False,True,False
4,45,80000,4,True,False,False,False,False,False,True,False,False,False,True

# feature scaling

In [8]:
from sklearn.preprocessing import StandardScaler

In [9]:
scaler = StandardScaler()

In [10]:
df_encoded[['Age','Income']]

   Age  Income
0   25   50000
1   30   60000
2   35   75000
3   40   90000
4   45   80000

In [11]:
scaler.fit_transform(df_encoded[['Age','Income']])

array([[-1.41421356, -1.47029409],
       [-0.70710678, -0.77015405],
       [ 0.        ,  0.28005602],
       [ 0.70710678,  1.33026608],
       [ 1.41421356,  0.63012604]])

# Feature Selection

In [12]:
from sklearn.feature_selection import RFE  # recursive feature elimination
from sklearn.linear_model import LinearRegression

In [13]:
X = df_encoded.drop('Productivity',axis = 1)
y = df_encoded['Productivity']

In [14]:
model = LinearRegression()

In [15]:
rfe = RFE(model, n_features_to_select = 3)
fit = rfe.fit(X,y)

In [16]:
selected_features = X.columns[fit.support_]
print('Selected Features:', selected_features)

Selected Features: Index(['Education_Bachelor', 'Education_High School', 'City_Los Angeles'], dtype='object')